'''
[문제]
2021년 12월, 네 번째로 개최된 ZOAC의 오프닝을 맡은 성우는 오프라인 대회를 대비하여 강의실을 예약하려고 한다.

강의실에서 대회를 치르려면 거리두기 수칙을 지켜야 한다!

한 명씩 앉을 수 있는 테이블이 행마다 W개씩 H행에 걸쳐 있을 때, 모든 참가자는 세로로 N칸 또는 가로로 M칸 이상 비우고 앉아야 한다.
즉, 다른 모든 참가자와 세로줄 번호의 차가 N보다 크거나 가로줄 번호의 차가 M보다 큰 곳에만 앉을 수 있다.

논문과 과제에 시달리는 성우를 위해 강의실이 거리두기 수칙을 지키면서 최대 몇 명을 수용할 수 있는지 구해보자.

W = 가로 
H = 세로 
N = 세로 간격 
M = 가로 간격
'''

H, W, N, M = map(int, input().split())

height = (H + N) // (N + 1)   # 세로 방향

width = (W + M) // (M + 1)   # 가로 방향

print(height * width)

# 세로 + 세로방향 간격 // 세로방향 +1 
# 가로 + 가로방향 간격 // 가로방향 +1