# BOJ 17204. 죽음의 게임 / D2
'''
문제
중앙대학교 소프트웨어대학 새내기들을 맞이하게 된 17학번 김영기는 두 학번이라는 차이를 극복하기 위해 새내기들과 친해지려고 노력하고 있다.
그 노력 중 하나는 바로 새내기들과의 술자리에 참여하는 것이다.
그러나 혼자 가기에 민망했던 영기는 동기 보성이를 꼬셔 같이 술자리에 참석했다.
새내기들과 같이 술을 마시게 된 영기와 보성이는 분위기가 가라 앉을 때쯤 The Game of Death라고 불리는 죽음의 술게임을 제안한다.

죽음의 게임의 룰은 간단하다.

게임에 참여하는 N명의 사람들은 원탁에 둘러앉게 된다.
게임을 시작하는 사람은 0번, 그 오른쪽 사람은 1번, 그 오른쪽은 2번, N-1번의 오른쪽 사람은 다시 0번이 된다.

0번이 "신난다! 아싸 재미난다! 아싸 더 게임 오브 데! 스!" 라고 외침과 동시에, 모든 사람들은 각각 테이블에 둘러 앉은 사람들 중 한 명을 지목한다.
그리고 나서 0번은 임의의 양의 정수 M을 외친다.

그 다음, 0번은 "1"이라고 말한다. 이때 "1"이라고 말한 사람이 지목한 사람은 "2"라고 말하고, "2"라고 말한 사람이 지목한 사람은 "3"이라고 말하고, 같은 방식으로 반복해 M까지 말하게 된다.
이때 마지막으로 M이라고 말한 사람이 지목한 사람은 벌주를 마시게 된다.

새내기에게 벌주를 마시게 하기에는 죄책감이 들었던 영기는 동기인 보성이를 공격하기로 결심했다.
게임 참여자들간에 지목을 완료한 상태가 주어질때, 보성이가 벌주를 마시기 위해 영기가 불러야 하는 가장 작은 양의 정수 M을 보성이 몰래 귀띔해 주도록 하자.

김영기는 게임을 제안하였기에 자연스럽게 0번이 된다.

입력
첫 번째 줄에 게임에 참여하는 사람의 수 N(3 ≤ N ≤ 150)과 보성이의 번호 K(1 ≤ K ≤ N - 1)가 공백을 두고 주어진다.

두번째 줄부터 N줄에 걸쳐 i(0 ≤ i ≤ N - 1)번 사람이 지목하는 사람의 번호 ai(0 ≤ ai ≤ N - 1)가 주어진다.
자기 자신을 지목하는 경우도 존재할 수 있다.

출력
영기가 말해야 하는 가장 작은 양의 정수 M을 출력한다. 만약 어떤 방법으로도 보성이가 걸리지 않는다면 -1을 출력한다.
'''
import sys
input = sys.stdin.readline

N, K = map(int, input().split())
pointing = [0] * N # 각 자리 사람이 지목한 번호 저장
for i in range(N):
    p = int(input().strip())
    pointing[i] = p

cnt = 0 # 보성이가 지목 받는 가장 작은 양의 정수
you = pointing[0] # 지목 / 초기값이 0 인덱스 사람이 지목한 숫자

for _ in range(N): # N번 회전했는데 보성이가 지목받지 않으면 지목 받지 않는 경우임
    cnt += 1 # 지목이 진행될때마다 cnt +1
    if you == K: # 보성이가 지목되면 멈춤
        break
    else: # 보성이가 아니면 you는 계속 최신화
        you = pointing[you]

if you != K: # 마지막에 지목되어있는 사람이 보성이가 아니면 -1
    print(-1)
else: # 마지막 지목된 사람이 보성이면 cnt 출력
    print(cnt)


'''
you라는 다음 지목할 인덱스를 넣을 변수를 설정하고
반복문 진행하면서 계속 최신화
visited를 만들고 방문한 곳에 다시 방문하면 무한히 돌아가는 케이스라 그 사이에 보성이가 없다면 -1
이런 방식으로 풀이해도 되지만, 보성이가 가장 늦게 지목되는 케이스는 N번째에 지목되는 것이므로
N번을 넘게 반복하면 -1이 출력되는 방식을 활용했다.
'''