# BOJ 1620. 나는야 포켓몬 마스터 이다솜
'''
첫째 줄에는 도감에 수록되어 있는 포켓몬의 개수 N이랑 내가 맞춰야 하는 문제의 개수 M이 주어져.
N과 M은 1보다 크거나 같고, 100,000보다 작거나 같은 자연수

둘째 줄부터 N개의 줄에 포켓몬의 번호가 1번인 포켓몬부터 N번에 해당하는 포켓몬까지 한 줄에 하나씩 입력으로 들어와.
포켓몬의 이름은 모두 영어로만 이루어져있고, 첫 글자만 대문자이고, 나머지 문자는 소문자로만 이루어져 있어.
일부 포켓몬은 마지막 문자만 대문자일 수도 있어.
포켓몬 이름의 최대 길이는 20, 최소 길이는 2야.
그 다음 줄부터 총 M개의 줄에 내가 맞춰야하는 문제가 입력으로 들어와.
문제가 알파벳으로만 들어오면 포켓몬 번호를 말해야 하고, 숫자로만 들어오면, 포켓몬 번호에 해당하는 문자를 출력해야해.
입력으로 들어오는 숫자는 반드시 1보다 크거나 같고, N보다 작거나 같고,
입력으로 들어오는 문자는 반드시 도감에 있는 포켓몬의 이름만 주어져.
'''
import sys
N, M = map(int, sys.stdin.readline().split())
ehrka = {} # dict 이름 '도감'
for i in range(1, N+1):
    P = sys.stdin.readline().strip()
    ehrka[str(i)] = P

rkaeh = {value: key for key, value in ehrka.items()} # 포켓몬 이름이 나왔을 떄 찾기 쉽게 하려고 '도감'의 키-값 변경, 이름 '감도'

for _ in range(M):
    Q = sys.stdin.readline().strip()
    if Q.isdigit():
        print(ehrka[Q])
    else:
        print(rkaeh[Q])

'''
도감을 순서대로 숫자를 키로 이름을 값으로 dict 형태로 입력
출력할때 들어온 값 Q가 숫자로 된 str인 경우 도감에서 뽑아냄
아닌경우 감도에서 뽑아 냄
처음 값을 출력하는데 None으로 출력되서 하나씩 print 찍어본 결과 \n 이 따라 붙음
그래서 strip() 을 사용하여 \n 없애고 출력
'''