# 17608. 막대기
'''
아래 그림처럼 높이만 다르고 (같은 높이의 막대기가 있을 수 있음) 모양이 같은 막대기를 일렬로 세운 후, 왼쪽부터 차례로 번호를 붙인다.
일렬로 세워진 막대기를 오른쪽에서 보면 보이는 막대기가 있고 보이지 않는 막대기가 있다.
N개의 막대기에 대한 높이 정보가 주어질 때, 오른쪽에서 보아서 몇 개가 보이는지를 알아내는 프로그램을 작성하려고 한다.

[입력]
첫 번째 줄에는 막대기의 개수를 나타내는 정수 N (2 ≤ N ≤ 100,000)이 주어지고 이어지는 N줄 각각에는 막대기의 높이를 나타내는 정수 h(1 ≤ h ≤ 100,000)가 주어진다.

[출력]
오른쪽에서 N개의 막대기를 보았을 때, 보이는 막대기의 개수를 출력한다.

배열을 뒤집고 뒷쪽에서부터 보면서 큰 수가 나오면 그 수 만큼 갯수를 세자.
'''
import sys
input = sys.stdin.readline
n = int(input())
stick = []
for _ in range(n):
    stick.append(int(input()))
stick.reverse()
cnt = 0
max_val = 0
for i in stick:
    if i > max_val:
        cnt += 1
        max_val = i
print(cnt)