/*
BOJ2872. 우리집엔 도서관이 있어

[문제]
상근이는 컴퓨터 공학의 일인자가 되기 위해 책을 매우 많이 구매했다. 하지만, 집에 책장이 없어서 책을 탑처럼 쌓아놓고 있다.
오늘은 오랜만에 상근이가 집에서 휴식을 취하는 날이다. 상근이는 책을 알파벳 순서대로 정렬하려고 한다.
사전 순으로 가장 앞서는 책은 가장 위에 놓고, 가장 뒤에 있는 책은 가장 밑에 놓아야 한다. 책을 정렬할 때 사용할 수 있는 방법은 책 하나를 뺀 다음, 가장 위에 놓는 것이다.
책은 1부터 N까지 번호가 책 이름의 사전 순으로 매겨져 있다. 1은 사전 순으로 가장 앞서는 책이다. 따라서, 위에서부터 책의 번호를 읽으면 (1, 2, ..., N)이 되어야 한다.

예를 들어, 책이 3권있고 처음에 (3, 2, 1)로 쌓여있을 때, 2번 만에 사전순으로 책을 쌓을 수 있다.
가장 먼저, 2번 책을 뺀 다음에 가장 위에 놓는다. 그렇게 되면 (2, 3, 1)이 된다.
마지막으로, 1을 뺀 다음 가장 위에 놓으면 (1, 2, 3)이 된다.

현재 책이 어떻게 쌓여있는지가 주어졌을 때, 몇 번만에 사전 순으로 쌓을 수 있는지 구하는 프로그램을 작성하시오.

[입력]
첫째 줄에 책의 개수 N이 주어진다. (N ≤ 300,000)
다음 N개 줄에는 가장 위에 있는 책부터 아래에 있는 책까지 순서대로 주어진다.

[출력]
첫째 줄에 몇 번만에 책을 정렬할 수 있는지 출력한다.
*/

#include <iostream>
#include <vector>
using namespace std;

// 책을 정렬하는 데 필요한 이동 횟수를 계산하는 함수
int countMovesToSortBooks(const vector<int>& books) {
    int N = books.size();  // N: 책의 총 권수
    int target = N;  // target: 목표로 찾을 책 번호를 N(마지막 번호)으로 초기화

    // 아래에서부터 책 번호가 target과 일치하는지 확인
    for (int i = N - 1; i >= 0; i--) {
        if (books[i] == target) {
            target--;
        } // 일치하면 다음 목표 책 번호로 감소
    }
    return target;  // 남은 책 수 = 옮겨야 하는 최소 횟수
}

int main() {
    ios::sync_with_stdio(false);
    cin.tie(nullptr);

    // 책의 개수 N을 입력으로 받아 저장
    int N;
    cin >> N;

    // books에 책 번호들을 위에서부터 입력으로 받아 저장
    vector<int> books(N);
    for (int i = 0; i < N; i++) {
        cin >> books[i];
    }

    // 옮겨야 하는 최소 횟수를 출력
    cout << countMovesToSortBooks(books) << "\n";
    return 0;
}
